Revit 2027 API
FabricationPart.GetSeamCount Method
 Gets the number of seams for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSeamCount()
Public Function GetSeamCount As Integer
public:
int GetSeamCount()
member GetSeamCount : unit -> int
Return Value
Int32
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace